console.log("----------------task 1------------------------------------");

/* Напишите программу, которая выводит в консоль все четные числа от 1 до 20. Используйте цикл for. */
for (let index = 1; index <= 20; index++) {
  if (index % 2 === 0) {
    console.log(`index: ${index}`);
  }
}

console.log("----------------task 2------------------------------------");
/* Напишите программу, которая подсчитывает сумму чисел от 1 до 100. Используйте цикл while.*/

let sum = 0;
let i = 1;

while (i <= 100) {
  sum += i;
  i++;
}
console.log(sum);

console.log("----------------task 3------------------------------------");
/* Обратный отсчет (с массивом и while)
Создайте массив с числами от 5 до 1.
Используйте цикл while, чтобы вывести все числа из массива в консоль.
После этого очистите массив с помощью pop (удаление последнего элемента массива) в цикле while.*/

let numbersArr = [5, 4, 3, 2, 1];
let index = 0;

while (index < numbersArr.length) {
  console.log(numbersArr[index]);
  index++;
}

console.log("----------------task 4------------------------------------");
/*
Таблица умножения
Напишите программу, которая выводит таблицу умножения для числа, 
введенного пользователем. Используйте цикл for.

Пример: Если пользователь ввел 5, программа должна вывести:
5 x 1 = 5
5 x 2 = 10
...
5 x 10 = 50
*/

console.log("----------------task 5------------------------------------");
// let userNumber = Number(prompt("Enter number"));

// for (let index = 1; index <= 10; index++) {
//     alert(userNumber * index);
// }

console.log("----------------task 6------------------------------------");
/* Нахождение суммы чисел
Напишите программу, которая запрашивает у пользователя два числа: 
начальное и конечное значение. Затем программа должна вычислить 
и вывести сумму всех чисел между ними (включая начальное и конечное). Используйте цикл while.

Пример: Если пользователь ввел начальное число 1 и конечное 5, программа должна вывести:
Сумма чисел от 1 до 5 равна 15. */

let firstNumber = Number(prompt("Enter first number"));
let lastNumber = Number(prompt("Enter last number"));

let firstLastNumberSum = 0;
let ind = firstNumber;

while (ind <= lastNumber) {
  firstLastNumberSum += ind;
  ind++;
}
alert(firstLastNumberSum);

